questions = [
    {"Q": "1. Наборы знаков, предназначенные для подтверждения личности в сети «Интернет»?",
     "O": ["капчи", "логин и пароль", "отпечатки пальцев"],
     "I": "",
     "A": ["логин и пароль"]},

    {"Q": "2. Травля, оскорбление или угрозы, высказываемые жертве с помощью сообщений в социальных сетях, электронных писем и СМС?",
     "O": ["моббинг", "кибербуллинг", "висхолдинг"],
     "I": "",
     "A": ["кибербуллинг"]},

    {"Q": "3. Введите ответ (слово).Что это за данные?",
     "O": [],
     "I": "AgACAgIAAxkBAAMdZc_YS5Gg4mqWjHkHFWAwp6ijvu0AAkDWMRvS14BK9275Bkb0UvYBAAMCAAN5AAM0BA",
     "A": ["биометрические"]},

    {"Q": "4. Введите ответ (слово). Наиболее общее основание, дающее право на обработку персональных данных?",
     "O": [],
     "I": "",
     "A": ["согласие"]},

    {"Q": "5. Введите ответ (слово). Хищение чужого путем обмана или злоупотребления доверием?",
     "O": [],
     "I": "",
     "A": ["мошенничество"]},

    {"Q": "6. Вид мошенничества (осуществляемого путем создания поддельных страниц входа в социальные сети, оплаты товаров и т.п.), целью которого является получение доступа к Вашим конфиденциальным данным - логинам и паролям, данным банковской карты.",
     "O": ["фишинг", "холдинг", "кастинг"],
     "I": "",
     "A": ["фишинг"]},

    {"Q": "7. Введите ответ (слово). Действия с персональными данными, в результате которых становится невозможным без использования дополнительной информации определить принадлежность персональных данных конкретному человеку?",
     "O": [],
     "I": "",
     "A": ["обезличивание"]},

    {"Q": "8. Наиболее распространенное расширение файлов, указывающее Вам на то, что файл потенциально может быть заражен вирусом?",
     "O": ["exe", "ppt", "ru", "docx"],
     "I": "",
     "A": ["exe"]},

    {"Q": "9. Это один из самых опасных типов вирусов, один из представителей которого смог уничтожить ядерную программу Ирана, распространяясь на USB накопителях.",
     "O": ["Черви", "Вымогатели", "Руткиты", "Троянцы"],
     "I": "",
     "A": ["черви"]},

    {"Q": "10. Эта хакерская группировка полностью децентрализованная, в нее может вступить каждый. Хотя они не связаны с пороховым заговором против английского и шотландского короля, но любят всю связанную с этим событием атрибутику.",
     "O": ["Anonymous", "Mysterious", "Unidentified", "Nameless"],
     "I": "",
     "A": ["anonymous"]},

    {"Q": "11. Когда-то так называли людей, которые бесплатно обменивались компьютерными программами. Затем их стали считать «виртуальными хулиганами». Сами они признают, что борются за свободный доступ к любой информации. Речь идет о:",
     "O": ["Хакеры", "Инженеры", "Аналитики"],
     "I": "",
     "A": ["хакеры"]},

    {"Q": "12. Магазин осуществляет сбор персональных данных на своем Интернет-сайте. Какое из условий необязательно, чтобы осуществление магазином сбора персональных данных было законным?",
     "O": ["Согласие на обработку персональных данных", "Размещение базы данных в России", "Размещение договора оферты"],
     "I": "",
     "A": ["размещение договора оферты"]},
]