questions = [
    {"Q": "1. Что выведет эта программа?\n\nprint('Hello world!')",
     "O": [],
     "I": "",
     "A": ["hello world!"]},

    {"Q": "2. Что выведет эта программа?\n\na = 1\nb = 4\nc = a + b * 2\nprint(c)",
     "O": [],
     "I": "",
     "A": ["9"]},

    {"Q": "3. Что выведет эта программа?\n\na = 11\nb = 2\nc = a % b\nd = a // b\nprint(c, d)",
     "O": [],
     "I": "",
     "A": ["1 5"]},

    {"Q": "4. Что выведет эта программа?\n\ns1 = '123'\ns2 = '456'\ns3 = s1 + s2\nprint(s3)",
     "O": [],
     "I": "",
     "A": ["123456"]},

    {"Q": "5. Что выведет эта программа?\n\na = 100\nif a % 2 == 0: print('YES')\nelse: print('NO')",
     "O": [],
     "I": "",
     "A": ["yes"]},

    {"Q": "6. Что выведет эта программа?\n\ns = 11\nfor i in range(100):\n    s += 1\nif s % 10 == 0: break\nprint(s)",
     "O": [],
     "I": "",
     "A": ["20"]},

    {"Q": "7. Что выведет эта программа?\n\ns = 0\nfor i in range(1, 5): s += i\n print(s)",
     "O": [],
     "I": "",
     "A": ["10"]},

    {"Q": "8. Что выведет эта программа?\n\ns = 1\nwhile s < 10: s *= 2\nprint(s)",
     "O": [],
     "I": "",
     "A": ["16"]},

    {"Q": "9.Сколько раз выполнится код внутри while?\n\ns = 1\nwhile s < 10: s *= 2",
     "O": [],
     "I": "",
     "A": ["4"]},

    {"Q": "10. Чему будет равно значение f(7)?\n\ndef f(n):\n    if n % 3 == 0:\n        n += 1\n        n *= 2\n        return n\n    elif n % 3 == 1:\n        n *= 2\n        n %= 10\n        return n    \nreturn n",
     "O": [],
     "I": "",
     "A": ["4"]}
]