questions = [
    {"Q": "1. Введите ответ (слово). Это конечный набор шагов, которые при следовании им решают какую-то задачу",
     "O": [],
     "I": "",
     "A": ["алгоритм"]},

    {"Q": "2. Введите ответ (слово). Это именованные ячейки памяти, которые используются для хранения данных программы, результатов ее вычислений",
     "O": [],
     "I": "",
     "A": ["переменные", "переменная"]},

    {"Q": "3. Введите ответ (слово). Что это за конструкции? for, while, do … while",
     "O": [],
     "I": "",
     "A": ["цикл", "циклы"]},

    {"Q": "4. Какая функция используется для ввода информации в Python?",
     "O": ["int()", "print()", "input()", "str()"],
     "I": "",
     "A": ["print()"]},

    {"Q": "5. Какое из приведенных утверждений является ложным?",
     "O": ["Python не является интерпретируемым языком программирования", "Программы на Python состоят из модулей", "Переменные в Python автоматически объявляются перед инициализацией"],
     "I": "",
     "A": ["Python не является интерпретируемым языком программирования"]},

    {"Q": "6. Какое значение из указанных может принимать переменная типа int?",
     "O": ["-10", "a10c", "7.8"],
     "I": "",
     "A": ["-10"]},

    {"Q": "7. Какой будет результат выполнения кода: print(+-1)?",
     "O": ["-1", "0", "1", "ошибка"],
     "I": "",
     "A": ["-1"]},

    {"Q": "8. Определите название функции «Квадратный корень»",
     "O": ["abs()", "randint()", "round()", "sqrt()"],
     "I": "",
     "A": ["sqrt()"]},

    {"Q": "9. Определите тип данных list",
     "O": ["целое число", "строка", "список", "кортеж"],
     "I": "",
     "A": ["список"]},

    {"Q": "10. Метод списка, для добавления элемента в конец списка",
     "O": ["index()", "append()", "pop()"],
     "I": "",
     "A": ["append()"]}
]